app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    if @image.save
---
INSERT INTO "images" ("image", "image_title", "image_file_size", "image_content_type", "image_description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 5]]

  def index
    @images = Image.all
    @categories = Category.all
---
SELECT "images".* FROM "images"
SELECT "categories".* FROM "categories"