app/views/images/new.html.erb

    <%= f.label :category %>
    <%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'},class:'form-control'%>
---
SELECT "categories".* FROM "categories"